una1veritas/ARMWork/stsw-stm32127/STM32-F1-F2-F4-L1_I2C_CPAL_V1.2.0/Utilities/STM32_EVAL_CPAL/STM3240_41_G_EVAL/stm324xg_eval_ioe_cpal.c
  /* Disable all options */
  IOE_DevStructure.wCPAL_Options  = 0;
  
  /* point to CPAL_TransferTypeDef structure */
  IOE_DevStructure.pCPAL_TransferRx = &IOE_RXTransfer;
  
  /* Configure transfer parameters */  
  IOE_DevStructure.pCPAL_TransferRx->wNumData = 1;
  IOE_DevStructure.pCPAL_TransferRx->pbBuffer = IOE_Buffer ;
  IOE_DevStructure.pCPAL_TransferRx->wAddr1   = (uint32_t)DeviceAddr;
  IOE_DevStructure.pCPAL_TransferRx->wAddr2   = (uint32_t)RegisterAddr;
  
  /* Read Operation */
  if(CPAL_I2C_Read(&IOE_DevStructure) == CPAL_PASS)
  {
    while ((IOE_DevStructure.CPAL_State != CPAL_STATE_READY) && (IOE_DevStructure.CPAL_State != CPAL_STATE_ERROR) )
    { }
  }
  /* Return the read value */
  return IOE_Buffer[0];
}


/**
  * @brief  Reads a buffer of 2 bytes from the device registers.
  * @param  DeviceAddr: The address of the device, could be : IOE_1_ADDR
  *         or IOE_2_ADDR. 
  * @param  RegisterAddr: The target register address (between 00x and 0x24)
  * @retval A pointer to the buffer containing the two returned bytes (in halfword).  
  */
uint16_t I2C_ReadDataBuffer(uint8_t DeviceAddr, uint32_t RegisterAddr)
{ 
  IOE_Buffer[0] = 0;
  IOE_Buffer[1] = 0;
  
  /* Disable all options */
  IOE_DevStructure.wCPAL_Options  = 0;
  
  /* point to CPAL_TransferTypeDef structure */
  IOE_DevStructure.pCPAL_TransferRx = &IOE_RXTransfer;
  
  /* Configure transfer parameters */  
  IOE_DevStructure.pCPAL_TransferRx->wNumData = 2;
  IOE_DevStructure.pCPAL_TransferRx->pbBuffer = IOE_Buffer ;
  IOE_DevStructure.pCPAL_TransferRx->wAddr1   = (uint32_t)DeviceAddr;
  IOE_DevStructure.pCPAL_TransferRx->wAddr2   = (uint32_t)RegisterAddr;
  
  /* read Operation */
  if (CPAL_I2C_Read(&IOE_DevStructure)== CPAL_PASS)
  {
    while ((IOE_DevStructure.CPAL_State != CPAL_STATE_READY) && (IOE_DevStructure.CPAL_State != CPAL_STATE_ERROR) )
    { }
  }
  
  /* return buffer value */
  return (uint16_t)(IOE_Buffer[1] + (IOE_Buffer[0]<<8));
}

/**
  * @brief  Return Touch Screen X position value
  * @param  None
  * @retval X position.
  */
static uint16_t IOE_TS_Read_X(void)
{
  int32_t x, xr;
 
  x = I2C_ReadDataBuffer(IOE_1_ADDR, IOE_REG_TSC_DATA_Y);
  
  /* first correction */
  xr =  (x * 320) >> 12;
  /* second correction */
  xr = ((xr * 32)/29) - 17;
  
  if(xr <= 0)
    xr = 0;
  
  return (uint16_t)(xr); 
}

/**
  * @brief  Return Touch Screen Y position value
  * @param  None
  * @retval Y position.
  */
static uint16_t IOE_TS_Read_Y(void)
{
  __IO int32_t y, yr;
  
  y= I2C_ReadDataBuffer(IOE_1_ADDR, IOE_REG_TSC_DATA_X);
  
  yr= (y * 240) >> 12;
  yr = ((yr * 240) / 217) - 12;
  
  if(yr <= 0)
    yr = 0;
  
  return (uint16_t)(yr); 
}

/**
  * @brief  Return Touch Screen Z position value
  * @param  None
  * @retval Z position.
  */
static uint16_t IOE_TS_Read_Z(void)
{
  uint32_t z;
  z = I2C_ReadDataBuffer(IOE_1_ADDR, IOE_REG_TSC_DATA_Z);
  
  
  if(z <= 0)
    z = 0;
  
  return (uint16_t)(z); 
}

/**
  * @brief  Initialize and Configure I2C Peripheral used to communicate with IO_Expanders.
  * @param  None
  * @retval None
  */
static void IOE_Init(void)
{    
  /* Deinitialize CPAL peripheral */
  CPAL_I2C_DeInit(&IOE_DevStructure);
  
  /* Initialize CPAL peripheral */
  CPAL_I2C_Init(&IOE_DevStructure);
}

/**
  * @brief  Initialize the CPAL structure used to communicate with IO_Expanders.
  * @param  None
  * @retval None
  */
static void IOE_StructInit(void)
{   
  /* Set CPAL structure parameters to their default values */  
  CPAL_I2C_StructInit(&IOE_DevStructure);
      
  /* Set I2C clock speed */
  IOE_DevStructure.pCPAL_I2C_Struct->I2C_ClockSpeed = I2C_SPEED;
  
#ifdef IOE_IT
  /* Select Interrupt programming model and disable all options */
  IOE_DevStructure.CPAL_ProgModel = CPAL_PROGMODEL_INTERRUPT;
  IOE_DevStructure.wCPAL_Options  = 0;
#else
  /* Select DMA programming model and activate TX_DMA_TC and RX_DMA_TC interrupts */
  IOE_DevStructure.CPAL_ProgModel = CPAL_PROGMODEL_DMA;
  IOE_DevStructure.wCPAL_Options  = 0;
#endif /* IOE_IT */

  /* point to CPAL_TransferTypeDef structure */
  IOE_DevStructure.pCPAL_TransferTx = &IOE_TXTransfer;
  IOE_DevStructure.pCPAL_TransferRx = &IOE_RXTransfer;
}
   
/**
  * @brief  Configures the IO expander Interrupt line and GPIO in EXTI mode.
  * @param  None        
  * @retval None
  */
static void IOE_EXTI_Config(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  NVIC_InitTypeDef NVIC_InitStructure;
  EXTI_InitTypeDef EXTI_InitStructure;
 
  /* Enable GPIO clock */
  RCC_AHB1PeriphClockCmd(IOE_IT_GPIO_CLK, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

  /* Configure Button pin as input floating */
  GPIO_InitStructure.GPIO_Pin = IOE_IT_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(IOE_IT_GPIO_PORT, &GPIO_InitStructure);  
  
  /* Connect Button EXTI Line to Button GPIO Pin */
  SYSCFG_EXTILineConfig(IOE_IT_EXTI_PORT_SOURCE, IOE_IT_EXTI_PIN_SOURCE);  
  
  /* Configure Button EXTI line */
  EXTI_InitStructure.EXTI_Line = IOE_IT_EXTI_LINE;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;  
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);
  
  /* Enable and set Button EXTI Interrupt to the lowest priority */
  NVIC_InitStructure.NVIC_IRQChannel = IOE_IT_EXTI_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
}

/**
  * @brief  User callback that manages the IOE errors.
  * @param  None
  * @retval None
  */ 
void IOE_TimeoutUserCallback(void)
{
  /* Configure the needed pins */
  IOE_EXTI_Config(); 
  
  /* Configure I2C device */
  IOE_StructInit();
  IOE_Init();
}  

#ifndef USE_Delay
/**
  * @brief  Inserts a delay time.
  * @param  nCount: specifies the delay time length.
  * @retval None
  */
static void delay(__IO uint32_t nCount)
{
  __IO uint32_t index = 0; 
  for(index = (100000 * nCount); index != 0; index--)
  {
  }
}
#endif /* USE_Delay*/
    
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
